import { useState } from "react";
import TableReport from "../../components/TableReport";
import Header from "../../components/Header";
import Footer from "../../components/Footer";

export default function App() {
  const [teachersData, setTeachersData] = useState([
    {
      id: 1,
      نام: "رضا",
      "نام خانوادگی": "احمدی",
      مدرک: "لیسانس",
      "نوع هیئت علمی": "نیمه وقت",
      "مرتبه استادی": "دانشیار",
      "حداکثر واحد": 10,
      "حداقل واحد": 5,
    },
    {
      id: 2,
      نام: "مرتضی",
      "نام خانوادگی": "پورحسینی",
      مدرک: "فوق لیسانس",
      "نوع هیئت علمی": "تمام وقت",
      "مرتبه استادی": "استاد",
      "حداکثر واحد": 10,
      "حداقل واحد": 5,
    },
    {
      id: 3,
      نام: "مریم",
      "نام خانوادگی": "احمدی",
      مدرک: "فوق لیسانس",
      "نوع هیئت علمی": "نیمه وقت",
      "مرتبه استادی": "دانشیار",
      "حداکثر واحد": 10,
      "حداقل واحد": 5,
    },
    {
      id: 4,
      نام: "مریم",
      "نام خانوادگی": "احمدی",
      مدرک: "فوق لیسانس",
      "نوع هیئت علمی": "نیمه وقت",
      "مرتبه استادی": "دانشیار",
      "حداکثر واحد": 10,
      "حداقل واحد": 5,
    },
    // {
    //   id: 2,
    //   نام: "مریم",
    //   "نام خانوادگی": "احمدی",
    //   مدرک: "فوق لیسانس",
    //   "نوع هیئت علمی": "نیمه وقت",
    //   "مرتبه استادی": "دانشیار",
    //   "حداکثر واحد": 10,
    //   "حداقل واحد": 5,
    // },
  ]);

  const handleDeleteTeacher = (id) => {
    if (!window.confirm("آیا مطمئن هستید می‌خواهید این استاد را حذف کنید؟"))
      return;
    setTeachersData((prev) => prev.filter((teacher) => teacher.id !== id));
  };

  const columns = [
    "نام",
    "نام خانوادگی",
    "مدرک",
    "نوع هیئت علمی",
    "مرتبه استادی",
    "حداکثر واحد",
    "حداقل واحد",
    "عملیات",
  ];

  return (
    <>
      <Header />
      <TableReport
        title="گزارش اساتید (داده تستی)"
        columns={columns}
        data={teachersData}
        onDelete={handleDeleteTeacher}
      />
      <Footer />
    </>
  );
}
